ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_peri.h
/***************************************************************************//**
* \file cyip_peri.h
*
* \brief
* PERI IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_PERI_H_
#define _CYIP_PERI_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                           PERI                                            ================ */
/* =========================================================================================================================== */

#define PERI_GR_SECTION_SIZE        0x00000040UL
#define PERI_TR_GR_SECTION_SIZE     0x00000200UL
#define PERI_PPU_PR_SECTION_SIZE    0x00000040UL
#define PERI_PPU_GR_SECTION_SIZE    0x00000040UL
#define PERI_GR_PPU_SL_SECTION_SIZE 0x00000040UL
#define PERI_GR_PPU_RG_SECTION_SIZE 0x00000040UL
#define PERI_SECTION_SIZE           0x00010000UL

/**
  * \brief Peripheral group structure (PERI_GR)
  */
typedef struct {
  __IOM uint32_t CLOCK_CTL;                     /*!< 0x00000000 Clock control                                                  */
   __IM uint32_t RESERVED[7];
  __IOM uint32_t SL_CTL;                        /*!< 0x00000020 Slave control                                                  */
  __IOM uint32_t TIMEOUT_CTL;                   /*!< 0x00000024 Timeout control                                                */
   __IM uint32_t RESERVED1[6];
} PERI_GR_Type;                                 /*!< Size = 40 (0x28)                                                          */

/**
  * \brief Trigger group (PERI_TR_GR)
  */
typedef struct {
  __IOM uint32_t TR_OUT_CTL[128];               /*!< 0x00000000 Trigger control register                                       */
} PERI_TR_GR_Type;                              /*!< Size = 512 (0x200)                                                        */

/**
  * \brief PPU structure with programmable address (PERI_PPU_PR)
  */
typedef struct {
  __IOM uint32_t ADDR0;                         /*!< 0x00000000 PPU region address 0 (slave structure)                         */
  __IOM uint32_t ATT0;                          /*!< 0x00000004 PPU region attributes 0 (slave structure)                      */
   __IM uint32_t RESERVED[6];
   __IM uint32_t ADDR1;                         /*!< 0x00000020 PPU region address 1 (master structure)                        */
  __IOM uint32_t ATT1;                          /*!< 0x00000024 PPU region attributes 1 (master structure)                     */
   __IM uint32_t RESERVED1[6];
} PERI_PPU_PR_Type;                             /*!< Size = 40 (0x28)                                                          */

/**
  * \brief PPU structure with fixed/constant address for a peripheral group (PERI_PPU_GR)
  */
typedef struct {
   __IM uint32_t ADDR0;                         /*!< 0x00000000 PPU region address 0 (slave structure)                         */
  __IOM uint32_t ATT0;                          /*!< 0x00000004 PPU region attributes 0 (slave structure)                      */
   __IM uint32_t RESERVED[6];
   __IM uint32_t ADDR1;                         /*!< 0x00000020 PPU region address 1 (master structure)                        */
  __IOM uint32_t ATT1;                          /*!< 0x00000024 PPU region attributes 1 (master structure)                     */
   __IM uint32_t RESERVED1[6];
} PERI_PPU_GR_Type;                             /*!< Size = 40 (0x28)                                                          */

/**
  * \brief PPU structure with fixed/constant address for a specific slave (PERI_GR_PPU_SL)
  */
typedef struct {
   __IM uint32_t ADDR0;                         /*!< 0x00000000 PPU region address 0 (slave structure)                         */
  __IOM uint32_t ATT0;                          /*!< 0x00000004 PPU region attributes 0 (slave structure)                      */
   __IM uint32_t RESERVED[6];
   __IM uint32_t ADDR1;                         /*!< 0x00000020 PPU region address 1 (master structure)                        */
  __IOM uint32_t ATT1;                          /*!< 0x00000024 PPU region attributes 1 (master structure)                     */
   __IM uint32_t RESERVED1[6];
} PERI_GR_PPU_SL_Type;                          /*!< Size = 40 (0x28)                                                          */

/**
  * \brief PPU structure with fixed/constant address for a specific region (PERI_GR_PPU_RG)
  */
typedef struct {
   __IM uint32_t ADDR0;                         /*!< 0x00000000 PPU region address 0 (slave structure)                         */
  __IOM uint32_t ATT0;                          /*!< 0x00000004 PPU region attributes 0 (slave structure)                      */
   __IM uint32_t RESERVED[6];
   __IM uint32_t ADDR1;                         /*!< 0x00000020 PPU region address 1 (master structure)                        */
  __IOM uint32_t ATT1;                          /*!< 0x00000024 PPU region attributes 1 (master structure)                     */
   __IM uint32_t RESERVED1[6];
} PERI_GR_PPU_RG_Type;                          /*!< Size = 40 (0x28)                                                          */

/**
  * \brief Peripheral interconnect (PERI)
  */
typedef struct {                                /*!< PERI Structure                                                            */
        PERI_GR_Type GR[16];                    /*!< 0x00000000 Peripheral group structure                                     */
  __IOM uint32_t DIV_CMD;                       /*!< 0x00000400 Divider command register                                       */
   __IM uint32_t RESERVED[255];
  __IOM uint32_t DIV_8_CTL[64];                 /*!< 0x00000800 Divider control register (for 8.0 divider)                     */
  __IOM uint32_t DIV_16_CTL[64];                /*!< 0x00000900 Divider control register (for 16.0 divider)                    */
  __IOM uint32_t DIV_16_5_CTL[64];              /*!< 0x00000A00 Divider control register (for 16.5 divider)                    */
  __IOM uint32_t DIV_24_5_CTL[63];              /*!< 0x00000B00 Divider control register (for 24.5 divider)                    */
   __IM uint32_t RESERVED1;
  __IOM uint32_t CLOCK_CTL[128];                /*!< 0x00000C00 Clock control register                                         */
   __IM uint32_t RESERVED2[128];
  __IOM uint32_t TR_CMD;                        /*!< 0x00001000 Trigger command register                                       */
   __IM uint32_t RESERVED3[1023];
        PERI_TR_GR_Type TR_GR[16];              /*!< 0x00002000 Trigger group                                                  */
        PERI_PPU_PR_Type PPU_PR[32];            /*!< 0x00004000 PPU structure with programmable address                        */
   __IM uint32_t RESERVED4[512];
        PERI_PPU_GR_Type PPU_GR[16];            /*!< 0x00005000 PPU structure with fixed/constant address for a peripheral
                                                                group                                                          */
} PERI_Type;                                    /*!< Size = 21504 (0x5400)                                                     */


/* ===================================================  PERI_GR.CLOCK_CTL  =================================================== */
#define PERI_GR_CLOCK_CTL_INT8_DIV_Pos    (8UL)                 /*!< PERI_GR CLOCK_CTL: INT8_DIV (Bit 8)                       */
#define PERI_GR_CLOCK_CTL_INT8_DIV_Msk    (0xff00UL)            /*!< PERI_GR CLOCK_CTL: INT8_DIV (Bitfield-Mask: 0xff)         */
/* ====================================================  PERI_GR.SL_CTL  ===================================================== */
#define PERI_GR_SL_CTL_ENABLED_0_Pos      (0UL)                 /*!< PERI_GR SL_CTL: ENABLED_0 (Bit 0)                         */
#define PERI_GR_SL_CTL_ENABLED_0_Msk      (0x1UL)               /*!< PERI_GR SL_CTL: ENABLED_0 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_1_Pos      (1UL)                 /*!< PERI_GR SL_CTL: ENABLED_1 (Bit 1)                         */
#define PERI_GR_SL_CTL_ENABLED_1_Msk      (0x2UL)               /*!< PERI_GR SL_CTL: ENABLED_1 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_2_Pos      (2UL)                 /*!< PERI_GR SL_CTL: ENABLED_2 (Bit 2)                         */
#define PERI_GR_SL_CTL_ENABLED_2_Msk      (0x4UL)               /*!< PERI_GR SL_CTL: ENABLED_2 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_3_Pos      (3UL)                 /*!< PERI_GR SL_CTL: ENABLED_3 (Bit 3)                         */
#define PERI_GR_SL_CTL_ENABLED_3_Msk      (0x8UL)               /*!< PERI_GR SL_CTL: ENABLED_3 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_4_Pos      (4UL)                 /*!< PERI_GR SL_CTL: ENABLED_4 (Bit 4)                         */
#define PERI_GR_SL_CTL_ENABLED_4_Msk      (0x10UL)              /*!< PERI_GR SL_CTL: ENABLED_4 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_5_Pos      (5UL)                 /*!< PERI_GR SL_CTL: ENABLED_5 (Bit 5)                         */
#define PERI_GR_SL_CTL_ENABLED_5_Msk      (0x20UL)              /*!< PERI_GR SL_CTL: ENABLED_5 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_6_Pos      (6UL)                 /*!< PERI_GR SL_CTL: ENABLED_6 (Bit 6)                         */
#define PERI_GR_SL_CTL_ENABLED_6_Msk      (0x40UL)              /*!< PERI_GR SL_CTL: ENABLED_6 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_7_Pos      (7UL)                 /*!< PERI_GR SL_CTL: ENABLED_7 (Bit 7)                         */
#define PERI_GR_SL_CTL_ENABLED_7_Msk      (0x80UL)              /*!< PERI_GR SL_CTL: ENABLED_7 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_8_Pos      (8UL)                 /*!< PERI_GR SL_CTL: ENABLED_8 (Bit 8)                         */
#define PERI_GR_SL_CTL_ENABLED_8_Msk      (0x100UL)             /*!< PERI_GR SL_CTL: ENABLED_8 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_9_Pos      (9UL)                 /*!< PERI_GR SL_CTL: ENABLED_9 (Bit 9)                         */
#define PERI_GR_SL_CTL_ENABLED_9_Msk      (0x200UL)             /*!< PERI_GR SL_CTL: ENABLED_9 (Bitfield-Mask: 0x01)           */
#define PERI_GR_SL_CTL_ENABLED_10_Pos     (10UL)                /*!< PERI_GR SL_CTL: ENABLED_10 (Bit 10)                       */
#define PERI_GR_SL_CTL_ENABLED_10_Msk     (0x400UL)             /*!< PERI_GR SL_CTL: ENABLED_10 (Bitfield-Mask: 0x01)          */
#define PERI_GR_SL_CTL_ENABLED_11_Pos     (11UL)                /*!< PERI_GR SL_CTL: ENABLED_11 (Bit 11)                       */
#define PERI_GR_SL_CTL_ENABLED_11_Msk     (0x800UL)             /*!< PERI_GR SL_CTL: ENABLED_11 (Bitfield-Mask: 0x01)          */
#define PERI_GR_SL_CTL_ENABLED_12_Pos     (12UL)                /*!< PERI_GR SL_CTL: ENABLED_12 (Bit 12)                       */
#define PERI_GR_SL_CTL_ENABLED_12_Msk     (0x1000UL)            /*!< PERI_GR SL_CTL: ENABLED_12 (Bitfield-Mask: 0x01)          */
#define PERI_GR_SL_CTL_ENABLED_13_Pos     (13UL)                /*!< PERI_GR SL_CTL: ENABLED_13 (Bit 13)                       */
#define PERI_GR_SL_CTL_ENABLED_13_Msk     (0x2000UL)            /*!< PERI_GR SL_CTL: ENABLED_13 (Bitfield-Mask: 0x01)          */
#define PERI_GR_SL_CTL_ENABLED_14_Pos     (14UL)                /*!< PERI_GR SL_CTL: ENABLED_14 (Bit 14)                       */
#define PERI_GR_SL_CTL_ENABLED_14_Msk     (0x4000UL)            /*!< PERI_GR SL_CTL: ENABLED_14 (Bitfield-Mask: 0x01)          */
#define PERI_GR_SL_CTL_ENABLED_15_Pos     (15UL)                /*!< PERI_GR SL_CTL: ENABLED_15 (Bit 15)                       */
#define PERI_GR_SL_CTL_ENABLED_15_Msk     (0x8000UL)            /*!< PERI_GR SL_CTL: ENABLED_15 (Bitfield-Mask: 0x01)          */
/* ==================================================  PERI_GR.TIMEOUT_CTL  ================================================== */
#define PERI_GR_TIMEOUT_CTL_TIMEOUT_Pos   (0UL)                 /*!< PERI_GR TIMEOUT_CTL: TIMEOUT (Bit 0)                      */
#define PERI_GR_TIMEOUT_CTL_TIMEOUT_Msk   (0xffffUL)            /*!< PERI_GR TIMEOUT_CTL: TIMEOUT (Bitfield-Mask: 0xffff)      */


