ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_peri.h
/* =================================================  PERI_TR_GR.TR_OUT_CTL  ================================================= */
#define PERI_TR_GR_TR_OUT_CTL_TR_SEL_Pos  (0UL)                 /*!< PERI_TR_GR TR_OUT_CTL: TR_SEL (Bit 0)                     */
#define PERI_TR_GR_TR_OUT_CTL_TR_SEL_Msk  (0x7fUL)              /*!< PERI_TR_GR TR_OUT_CTL: TR_SEL (Bitfield-Mask: 0x7f)       */
#define PERI_TR_GR_TR_OUT_CTL_TR_INV_Pos  (8UL)                 /*!< PERI_TR_GR TR_OUT_CTL: TR_INV (Bit 8)                     */
#define PERI_TR_GR_TR_OUT_CTL_TR_INV_Msk  (0x100UL)             /*!< PERI_TR_GR TR_OUT_CTL: TR_INV (Bitfield-Mask: 0x01)       */
#define PERI_TR_GR_TR_OUT_CTL_TR_EDGE_Pos (9UL)                 /*!< PERI_TR_GR TR_OUT_CTL: TR_EDGE (Bit 9)                    */
#define PERI_TR_GR_TR_OUT_CTL_TR_EDGE_Msk (0x200UL)             /*!< PERI_TR_GR TR_OUT_CTL: TR_EDGE (Bitfield-Mask: 0x01)      */


/* ===================================================  PERI_PPU_PR.ADDR0  =================================================== */
#define PERI_PPU_PR_ADDR0_SUBREGION_DISABLE_Pos (0UL)           /*!< PERI_PPU_PR ADDR0: SUBREGION_DISABLE (Bit 0)              */
#define PERI_PPU_PR_ADDR0_SUBREGION_DISABLE_Msk (0xffUL)        /*!< PERI_PPU_PR ADDR0: SUBREGION_DISABLE (Bitfield-Mask: 0xff)*/
#define PERI_PPU_PR_ADDR0_ADDR24_Pos      (8UL)                 /*!< PERI_PPU_PR ADDR0: ADDR24 (Bit 8)                         */
#define PERI_PPU_PR_ADDR0_ADDR24_Msk      (0xffffff00UL)        /*!< PERI_PPU_PR ADDR0: ADDR24 (Bitfield-Mask: 0xffffff)       */
/* ===================================================  PERI_PPU_PR.ATT0  ==================================================== */
#define PERI_PPU_PR_ATT0_UR_Pos           (0UL)                 /*!< PERI_PPU_PR ATT0: UR (Bit 0)                              */
#define PERI_PPU_PR_ATT0_UR_Msk           (0x1UL)               /*!< PERI_PPU_PR ATT0: UR (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_UW_Pos           (1UL)                 /*!< PERI_PPU_PR ATT0: UW (Bit 1)                              */
#define PERI_PPU_PR_ATT0_UW_Msk           (0x2UL)               /*!< PERI_PPU_PR ATT0: UW (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_UX_Pos           (2UL)                 /*!< PERI_PPU_PR ATT0: UX (Bit 2)                              */
#define PERI_PPU_PR_ATT0_UX_Msk           (0x4UL)               /*!< PERI_PPU_PR ATT0: UX (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_PR_Pos           (3UL)                 /*!< PERI_PPU_PR ATT0: PR (Bit 3)                              */
#define PERI_PPU_PR_ATT0_PR_Msk           (0x8UL)               /*!< PERI_PPU_PR ATT0: PR (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_PW_Pos           (4UL)                 /*!< PERI_PPU_PR ATT0: PW (Bit 4)                              */
#define PERI_PPU_PR_ATT0_PW_Msk           (0x10UL)              /*!< PERI_PPU_PR ATT0: PW (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_PX_Pos           (5UL)                 /*!< PERI_PPU_PR ATT0: PX (Bit 5)                              */
#define PERI_PPU_PR_ATT0_PX_Msk           (0x20UL)              /*!< PERI_PPU_PR ATT0: PX (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_NS_Pos           (6UL)                 /*!< PERI_PPU_PR ATT0: NS (Bit 6)                              */
#define PERI_PPU_PR_ATT0_NS_Msk           (0x40UL)              /*!< PERI_PPU_PR ATT0: NS (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT0_PC_MASK_0_Pos    (8UL)                 /*!< PERI_PPU_PR ATT0: PC_MASK_0 (Bit 8)                       */
#define PERI_PPU_PR_ATT0_PC_MASK_0_Msk    (0x100UL)             /*!< PERI_PPU_PR ATT0: PC_MASK_0 (Bitfield-Mask: 0x01)         */
#define PERI_PPU_PR_ATT0_PC_MASK_15_TO_1_Pos (9UL)              /*!< PERI_PPU_PR ATT0: PC_MASK_15_TO_1 (Bit 9)                 */
#define PERI_PPU_PR_ATT0_PC_MASK_15_TO_1_Msk (0xfffe00UL)       /*!< PERI_PPU_PR ATT0: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff) */
#define PERI_PPU_PR_ATT0_REGION_SIZE_Pos  (24UL)                /*!< PERI_PPU_PR ATT0: REGION_SIZE (Bit 24)                    */
#define PERI_PPU_PR_ATT0_REGION_SIZE_Msk  (0x1f000000UL)        /*!< PERI_PPU_PR ATT0: REGION_SIZE (Bitfield-Mask: 0x1f)       */
#define PERI_PPU_PR_ATT0_PC_MATCH_Pos     (30UL)                /*!< PERI_PPU_PR ATT0: PC_MATCH (Bit 30)                       */
#define PERI_PPU_PR_ATT0_PC_MATCH_Msk     (0x40000000UL)        /*!< PERI_PPU_PR ATT0: PC_MATCH (Bitfield-Mask: 0x01)          */
#define PERI_PPU_PR_ATT0_ENABLED_Pos      (31UL)                /*!< PERI_PPU_PR ATT0: ENABLED (Bit 31)                        */
#define PERI_PPU_PR_ATT0_ENABLED_Msk      (0x80000000UL)        /*!< PERI_PPU_PR ATT0: ENABLED (Bitfield-Mask: 0x01)           */
/* ===================================================  PERI_PPU_PR.ADDR1  =================================================== */
#define PERI_PPU_PR_ADDR1_SUBREGION_DISABLE_Pos (0UL)           /*!< PERI_PPU_PR ADDR1: SUBREGION_DISABLE (Bit 0)              */
#define PERI_PPU_PR_ADDR1_SUBREGION_DISABLE_Msk (0xffUL)        /*!< PERI_PPU_PR ADDR1: SUBREGION_DISABLE (Bitfield-Mask: 0xff)*/
#define PERI_PPU_PR_ADDR1_ADDR24_Pos      (8UL)                 /*!< PERI_PPU_PR ADDR1: ADDR24 (Bit 8)                         */
#define PERI_PPU_PR_ADDR1_ADDR24_Msk      (0xffffff00UL)        /*!< PERI_PPU_PR ADDR1: ADDR24 (Bitfield-Mask: 0xffffff)       */
/* ===================================================  PERI_PPU_PR.ATT1  ==================================================== */
#define PERI_PPU_PR_ATT1_UR_Pos           (0UL)                 /*!< PERI_PPU_PR ATT1: UR (Bit 0)                              */
#define PERI_PPU_PR_ATT1_UR_Msk           (0x1UL)               /*!< PERI_PPU_PR ATT1: UR (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_UW_Pos           (1UL)                 /*!< PERI_PPU_PR ATT1: UW (Bit 1)                              */
#define PERI_PPU_PR_ATT1_UW_Msk           (0x2UL)               /*!< PERI_PPU_PR ATT1: UW (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_UX_Pos           (2UL)                 /*!< PERI_PPU_PR ATT1: UX (Bit 2)                              */
#define PERI_PPU_PR_ATT1_UX_Msk           (0x4UL)               /*!< PERI_PPU_PR ATT1: UX (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_PR_Pos           (3UL)                 /*!< PERI_PPU_PR ATT1: PR (Bit 3)                              */
#define PERI_PPU_PR_ATT1_PR_Msk           (0x8UL)               /*!< PERI_PPU_PR ATT1: PR (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_PW_Pos           (4UL)                 /*!< PERI_PPU_PR ATT1: PW (Bit 4)                              */
#define PERI_PPU_PR_ATT1_PW_Msk           (0x10UL)              /*!< PERI_PPU_PR ATT1: PW (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_PX_Pos           (5UL)                 /*!< PERI_PPU_PR ATT1: PX (Bit 5)                              */
#define PERI_PPU_PR_ATT1_PX_Msk           (0x20UL)              /*!< PERI_PPU_PR ATT1: PX (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_NS_Pos           (6UL)                 /*!< PERI_PPU_PR ATT1: NS (Bit 6)                              */
#define PERI_PPU_PR_ATT1_NS_Msk           (0x40UL)              /*!< PERI_PPU_PR ATT1: NS (Bitfield-Mask: 0x01)                */
#define PERI_PPU_PR_ATT1_PC_MASK_0_Pos    (8UL)                 /*!< PERI_PPU_PR ATT1: PC_MASK_0 (Bit 8)                       */
#define PERI_PPU_PR_ATT1_PC_MASK_0_Msk    (0x100UL)             /*!< PERI_PPU_PR ATT1: PC_MASK_0 (Bitfield-Mask: 0x01)         */
#define PERI_PPU_PR_ATT1_PC_MASK_15_TO_1_Pos (9UL)              /*!< PERI_PPU_PR ATT1: PC_MASK_15_TO_1 (Bit 9)                 */
#define PERI_PPU_PR_ATT1_PC_MASK_15_TO_1_Msk (0xfffe00UL)       /*!< PERI_PPU_PR ATT1: PC_MASK_15_TO_1 (Bitfield-Mask: 0x7fff) */
#define PERI_PPU_PR_ATT1_REGION_SIZE_Pos  (24UL)                /*!< PERI_PPU_PR ATT1: REGION_SIZE (Bit 24)                    */
#define PERI_PPU_PR_ATT1_REGION_SIZE_Msk  (0x1f000000UL)        /*!< PERI_PPU_PR ATT1: REGION_SIZE (Bitfield-Mask: 0x1f)       */
#define PERI_PPU_PR_ATT1_PC_MATCH_Pos     (30UL)                /*!< PERI_PPU_PR ATT1: PC_MATCH (Bit 30)                       */
#define PERI_PPU_PR_ATT1_PC_MATCH_Msk     (0x40000000UL)        /*!< PERI_PPU_PR ATT1: PC_MATCH (Bitfield-Mask: 0x01)          */
#define PERI_PPU_PR_ATT1_ENABLED_Pos      (31UL)                /*!< PERI_PPU_PR ATT1: ENABLED (Bit 31)                        */
#define PERI_PPU_PR_ATT1_ENABLED_Msk      (0x80000000UL)        /*!< PERI_PPU_PR ATT1: ENABLED (Bitfield-Mask: 0x01)           */


