ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_peri.h
/* =====================================================  PERI.DIV_CMD  ====================================================== */
#define PERI_DIV_CMD_DIV_SEL_Pos          (0UL)                 /*!< PERI DIV_CMD: DIV_SEL (Bit 0)                             */
#define PERI_DIV_CMD_DIV_SEL_Msk          (0x3fUL)              /*!< PERI DIV_CMD: DIV_SEL (Bitfield-Mask: 0x3f)               */
#define PERI_DIV_CMD_TYPE_SEL_Pos         (6UL)                 /*!< PERI DIV_CMD: TYPE_SEL (Bit 6)                            */
#define PERI_DIV_CMD_TYPE_SEL_Msk         (0xc0UL)              /*!< PERI DIV_CMD: TYPE_SEL (Bitfield-Mask: 0x03)              */
#define PERI_DIV_CMD_PA_DIV_SEL_Pos       (8UL)                 /*!< PERI DIV_CMD: PA_DIV_SEL (Bit 8)                          */
#define PERI_DIV_CMD_PA_DIV_SEL_Msk       (0x3f00UL)            /*!< PERI DIV_CMD: PA_DIV_SEL (Bitfield-Mask: 0x3f)            */
#define PERI_DIV_CMD_PA_TYPE_SEL_Pos      (14UL)                /*!< PERI DIV_CMD: PA_TYPE_SEL (Bit 14)                        */
#define PERI_DIV_CMD_PA_TYPE_SEL_Msk      (0xc000UL)            /*!< PERI DIV_CMD: PA_TYPE_SEL (Bitfield-Mask: 0x03)           */
#define PERI_DIV_CMD_DISABLE_Pos          (30UL)                /*!< PERI DIV_CMD: DISABLE (Bit 30)                            */
#define PERI_DIV_CMD_DISABLE_Msk          (0x40000000UL)        /*!< PERI DIV_CMD: DISABLE (Bitfield-Mask: 0x01)               */
#define PERI_DIV_CMD_ENABLE_Pos           (31UL)                /*!< PERI DIV_CMD: ENABLE (Bit 31)                             */
#define PERI_DIV_CMD_ENABLE_Msk           (0x80000000UL)        /*!< PERI DIV_CMD: ENABLE (Bitfield-Mask: 0x01)                */
/* ====================================================  PERI.DIV_8_CTL  ===================================================== */
#define PERI_DIV_8_CTL_EN_Pos             (0UL)                 /*!< PERI DIV_8_CTL: EN (Bit 0)                                */
#define PERI_DIV_8_CTL_EN_Msk             (0x1UL)               /*!< PERI DIV_8_CTL: EN (Bitfield-Mask: 0x01)                  */
#define PERI_DIV_8_CTL_INT8_DIV_Pos       (8UL)                 /*!< PERI DIV_8_CTL: INT8_DIV (Bit 8)                          */
#define PERI_DIV_8_CTL_INT8_DIV_Msk       (0xff00UL)            /*!< PERI DIV_8_CTL: INT8_DIV (Bitfield-Mask: 0xff)            */
/* ====================================================  PERI.DIV_16_CTL  ==================================================== */
#define PERI_DIV_16_CTL_EN_Pos            (0UL)                 /*!< PERI DIV_16_CTL: EN (Bit 0)                               */
#define PERI_DIV_16_CTL_EN_Msk            (0x1UL)               /*!< PERI DIV_16_CTL: EN (Bitfield-Mask: 0x01)                 */
#define PERI_DIV_16_CTL_INT16_DIV_Pos     (8UL)                 /*!< PERI DIV_16_CTL: INT16_DIV (Bit 8)                        */
#define PERI_DIV_16_CTL_INT16_DIV_Msk     (0xffff00UL)          /*!< PERI DIV_16_CTL: INT16_DIV (Bitfield-Mask: 0xffff)        */
/* ===================================================  PERI.DIV_16_5_CTL  =================================================== */
#define PERI_DIV_16_5_CTL_EN_Pos          (0UL)                 /*!< PERI DIV_16_5_CTL: EN (Bit 0)                             */
#define PERI_DIV_16_5_CTL_EN_Msk          (0x1UL)               /*!< PERI DIV_16_5_CTL: EN (Bitfield-Mask: 0x01)               */
#define PERI_DIV_16_5_CTL_FRAC5_DIV_Pos   (3UL)                 /*!< PERI DIV_16_5_CTL: FRAC5_DIV (Bit 3)                      */
#define PERI_DIV_16_5_CTL_FRAC5_DIV_Msk   (0xf8UL)              /*!< PERI DIV_16_5_CTL: FRAC5_DIV (Bitfield-Mask: 0x1f)        */
#define PERI_DIV_16_5_CTL_INT16_DIV_Pos   (8UL)                 /*!< PERI DIV_16_5_CTL: INT16_DIV (Bit 8)                      */
#define PERI_DIV_16_5_CTL_INT16_DIV_Msk   (0xffff00UL)          /*!< PERI DIV_16_5_CTL: INT16_DIV (Bitfield-Mask: 0xffff)      */
/* ===================================================  PERI.DIV_24_5_CTL  =================================================== */
#define PERI_DIV_24_5_CTL_EN_Pos          (0UL)                 /*!< PERI DIV_24_5_CTL: EN (Bit 0)                             */
#define PERI_DIV_24_5_CTL_EN_Msk          (0x1UL)               /*!< PERI DIV_24_5_CTL: EN (Bitfield-Mask: 0x01)               */
#define PERI_DIV_24_5_CTL_FRAC5_DIV_Pos   (3UL)                 /*!< PERI DIV_24_5_CTL: FRAC5_DIV (Bit 3)                      */
#define PERI_DIV_24_5_CTL_FRAC5_DIV_Msk   (0xf8UL)              /*!< PERI DIV_24_5_CTL: FRAC5_DIV (Bitfield-Mask: 0x1f)        */
#define PERI_DIV_24_5_CTL_INT24_DIV_Pos   (8UL)                 /*!< PERI DIV_24_5_CTL: INT24_DIV (Bit 8)                      */
#define PERI_DIV_24_5_CTL_INT24_DIV_Msk   (0xffffff00UL)        /*!< PERI DIV_24_5_CTL: INT24_DIV (Bitfield-Mask: 0xffffff)    */
/* ====================================================  PERI.CLOCK_CTL  ===================================================== */
#define PERI_CLOCK_CTL_DIV_SEL_Pos        (0UL)                 /*!< PERI CLOCK_CTL: DIV_SEL (Bit 0)                           */
#define PERI_CLOCK_CTL_DIV_SEL_Msk        (0x3fUL)              /*!< PERI CLOCK_CTL: DIV_SEL (Bitfield-Mask: 0x3f)             */
#define PERI_CLOCK_CTL_TYPE_SEL_Pos       (6UL)                 /*!< PERI CLOCK_CTL: TYPE_SEL (Bit 6)                          */
#define PERI_CLOCK_CTL_TYPE_SEL_Msk       (0xc0UL)              /*!< PERI CLOCK_CTL: TYPE_SEL (Bitfield-Mask: 0x03)            */
/* ======================================================  PERI.TR_CMD  ====================================================== */
#define PERI_TR_CMD_TR_SEL_Pos            (0UL)                 /*!< PERI TR_CMD: TR_SEL (Bit 0)                               */
#define PERI_TR_CMD_TR_SEL_Msk            (0x7fUL)              /*!< PERI TR_CMD: TR_SEL (Bitfield-Mask: 0x7f)                 */
#define PERI_TR_CMD_GROUP_SEL_Pos         (8UL)                 /*!< PERI TR_CMD: GROUP_SEL (Bit 8)                            */
#define PERI_TR_CMD_GROUP_SEL_Msk         (0xf00UL)             /*!< PERI TR_CMD: GROUP_SEL (Bitfield-Mask: 0x0f)              */
#define PERI_TR_CMD_COUNT_Pos             (16UL)                /*!< PERI TR_CMD: COUNT (Bit 16)                               */
#define PERI_TR_CMD_COUNT_Msk             (0xff0000UL)          /*!< PERI TR_CMD: COUNT (Bitfield-Mask: 0xff)                  */
#define PERI_TR_CMD_OUT_SEL_Pos           (30UL)                /*!< PERI TR_CMD: OUT_SEL (Bit 30)                             */
#define PERI_TR_CMD_OUT_SEL_Msk           (0x40000000UL)        /*!< PERI TR_CMD: OUT_SEL (Bitfield-Mask: 0x01)                */
#define PERI_TR_CMD_ACTIVATE_Pos          (31UL)                /*!< PERI TR_CMD: ACTIVATE (Bit 31)                            */
#define PERI_TR_CMD_ACTIVATE_Msk          (0x80000000UL)        /*!< PERI TR_CMD: ACTIVATE (Bitfield-Mask: 0x01)               */


#endif /* _CYIP_PERI_H_ */


/* [] END OF FILE */
